using GeodesyApi.Data.Models;
using GeodesyApi.Data.Models.Enums;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace GeodesyApi.Data.Seeding
{
    public class NewsSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.News.Any())
            {
                return;
            }

            var images = new[]
            {
                "https://res.cloudinary.com/dv3tfjvk0/image/upload/v1587670017/news_ybqqwa.jpg",
                "https://res.cloudinary.com/dv3tfjvk0/image/upload/v1587670017/news5_mqguo6.jpg",
                "https://res.cloudinary.com/dv3tfjvk0/image/upload/v1587670017/1024px-Newspaper_k4q3og.png",
                "https://res.cloudinary.com/dv3tfjvk0/image/upload/v1587670017/news3_egyney.jpg",
                "https://res.cloudinary.com/dv3tfjvk0/image/upload/v1587670017/news2_jdfvho.jpg",
                "https://res.cloudinary.com/dv3tfjvk0/image/upload/v1587670016/news4_tbzce7.jpg",
            };

            var title = "Equal title for each news!";
            var content = @"В началото на новата година организациите на геодезическото съсловие се обърнаха с проблемите си към министъра на регионалното развитие и благоустройството Николай Нанков и към изпълнителния директор на Агенцията по геодезия картография и кадастър инж. Михаил Киров.

Четирите организации изпратиха общо писмо до министър Нанков. Те отбелязват, че през изминалите седем месеца са отправили две писмени покани за организиране на среща за развитието на геодезическия бранш, която така и не се е състояла, въпреки обещаното от министъра. „Изпълнителният директор на подведомствената Ви Агенция по геодезия, картография и кадастър (АГКК) организира една единствена среща при встъпването му на тази длъжност през месец юни 2017г., след което диалогът на единствената държавна администрация, която е отговорна за геодезическия бранш в България с неправителствените организации не се разви“, пишат инж. Милен Димиев, председател на КИГ, инж. Николай Киров, председател на АГФ, инж. Николай Главинчев, председател на секция Геодезия към КИИП и д-р инж. Иван Калчев, председател на СГЗБ. Четиримата допълват, че не се почувства развитието, което се очакваше от колегията с назначаване на инж. Валентин Йовев (инженер геодезист) за ресорен зам. министър на МРРБ. Геодезистите отбелязват, че периодът може да се обяви за най-динамичния през последните 25 години по отношение на поредицата от персонални кадрови смени в ръководството на АГКК и да се оцени като рекорден по отношение на провалени и невъзложени планирани обществени поръчки за кадастрални и геодезически дейности. Заключението на геодезистите е, че това състояние на сектора геодезия и кадастър определено не може да носи увереност и надежди за стабилност, предсказуемост, развитие и перспективност.

Те подчертават, че в този период се констатират и определени опити за изземване на значителна част от професионалните ни ангажименти чрез предложения в Проект на Наредба за изменение и допълнение на Наредба № 4/2001 г. за обхвата и съдържанието на инвестиционните проекти, обсъждана от работна група по заповед на министър Нанков № РД-02-14-515/08.06.2017 г.

Председателите на четирите съсловни организации отбелязват, че не може да се отбележи напредък и по предприетата инициатива от предходното ръководство на АГКК за създаване на работна група за разработване на проект на дългосрочна програма за устойчиво развитие на политиките в областта на геодезията, картографията и кадастъра. „Създадена със заповед на Изпълнителния директор на АГКК от 29.03.2017 г. и променена през юни 2017 г. работната група практически е спряла дейността си“, отбелязват геодезистите. Те подчертават, че от март 2015 г. не се е състояло нито едно заседание на Съвета по геодезия, картография и кадастър съгласно изискванията на чл. 8, ал. 1 и ал. 2 от Закона за геодезията и картографията и Устройствения правилник на МРРБ. Те предлагат среща в най-кратък срок с министъра.

Писма до инж. Киров

В писмо до директора на АГКК инж. Михаил Киров, КИГ предложиха в състава на комисията за разглеждане на обществените поръчки в областта на геодезията и кадастъра да бъде включен като наблюдаващ член и представител на НПО: адв. Лъчезар Тодоров от Софийска адвокатска колегия.

От камарата отбелязват, че очакват активен диалог с АГКК и участие в необходимите изменения на нормативната уредба. Става дума за следните документи: Наредба № 3 от 16 февруари 2001 г. за водене и съхраняване на регистъра на лицата, правоспособни да извършват дейности по кадастъра (с цел регламентиране на правоспособностите по геодезия и картография, съгласно изискванията на чл. 12, т.8 от ЗКИР); Инструкция № РД-02-20- 25 от 20 септември 2011 г. за определяне на геодезически точки с помощта на глобални навигационни спътникови системи и други. От КИГ отбелязват, че имат притеснения от бавната работа на работната група за разработване на проект на дългосрочна програма за устойчиво развитие на политиките в областта на геодезията, картографията и кадастъра.

Председателят на камарата Милен Димиев отбелязва, че се налага спешно преразглеждане на изискванията за участие в обществени поръчки по кадастър, които в момента водят до дискриминиране на инженерите геодезисти с под 10 г. трудов стаж, за сметка на колеги, неработещи активно и по специалността си от години, но имащи богат трудов стаж през миналия век, което би довело до демотивиране и пренасочване на младите специалисти - инженери по геодезия, в други професионални направления.";
            var seededNews = new List<News>();
            var random = new Random();



            for (int i = 0; i < 20; i++)
            {
                var enums = (int)random.Next(1, 3);

                var news = new News
                {
                    ImageUrl = images.Skip(random.Next(0, images.Count() - 1))
                           .FirstOrDefault(),
                    Category = (NewsType)enums,
                    Group = (NewsGroupType)enums,
                    Title = title,
                    Content = content,
                    UserId = dbContext.ApplicationUsers
                              .Select(u => u.Id)
                              .Skip(random.Next(0, 2))
                              .FirstOrDefault(),
                   // Comments=
                };

                seededNews.Add(news);
            }

            dbContext.News.AddRange(seededNews);
        }
    }
}
